name: "logreg.CatRaRE_Deploy"
layer {
    name: "data"
    type: "Input"
    top: "data"
    input_param { shape: { dim: 1 dim: 5 dim: 39 dim: 33 } }
}
################################
# simple logistic regression classifier
################################
layer {
       name: "fc"
       type: "InnerProduct"
       bottom: "data"
       top: "out"
       inner_product_param {
			    num_output: 2
	  }
   }
layer {
  name: "loss"
  type: "Softmax"
  bottom: "out"
  top: "loss"
}
